Tirta7/voc_master_data_center/esp32_mqtt_client/esp32_moc3062_singletable.ino
void startDoubleBuzzer() {
  buzzerBeepsRemaining = 2;
  buzzerState = true;
  buzzerToneDuration = 150;
  buzzerPauseDuration = 150;
  digitalWrite(PIN_BUZZER, HIGH);
  buzzerNextToggle = millis() + 150;
}

void startLongBuzzer() { // Indikator masuk mode Portal
  buzzerBeepsRemaining = 1;
  buzzerState = true;
  buzzerToneDuration = 2000;
  digitalWrite(PIN_BUZZER, HIGH);
  buzzerNextToggle = millis() + 2000;
}

// ─────────────────────────────────────────────────────────────
// CONFIGURATION PERSISTENCE (NVM via Preferences)
// ─────────────────────────────────────────────────────────────

void loadSettings() {
  preferences.begin("voc-config", true); // Mode RO

  String s_ssid = preferences.getString("ssid", "");
  String s_pass = preferences.getString("pass", "");
  String s_mqtt = preferences.getString("mqtt", "");
  mqtt_port = preferences.getInt("port", 1883);
  mocPin = preferences.getInt("mocPin", 4);
  MOC_ACTIVE_LOW = preferences.getBool("activeLow", true);

  s_ssid.toCharArray(ssid, 33);
  s_pass.toCharArray(password, 65);
  s_mqtt.toCharArray(mqtt_server, 40);

  preferences.end();

  Serial.println("[CONFIG] Settings loaded from memory.");
}

void saveSettings(const char *s, const char *p, const char *m, int pt, int mp,
                  bool al) {
  preferences.begin("voc-config", false); // Mode RW
  preferences.putString("ssid", s);
  preferences.putString("pass", p);
  preferences.putString("mqtt", m);
  preferences.putInt("port", pt);
  preferences.putInt("mocPin", mp);
  preferences.putBool("activeLow", al);
  preferences.end();
  Serial.println("[CONFIG] Settings saved successfully.");
}

void factoryReset() {
  preferences.begin("voc-config", false);
  preferences.clear();
  preferences.end();
  Serial.println("[CONFIG] All settings cleared! Rebooting...");
  startLongBuzzer();
  delay(2100);
  ESP.restart();
}

// ─────────────────────────────────────────────────────────────
// WEB PORTAL (Captive Portal UI)
// ─────────────────────────────────────────────────────────────

String getHeader() {
  return "<!DOCTYPE html><html><head>"
         "<meta charset='UTF-8'><meta name='viewport' "
         "content='width=device-width, initial-scale=1.0'>"
         "<link "
         "href='https://fonts.googleapis.com/"
         "css2?family=Outfit:wght@300;400;600;800&display=swap' "
         "rel='stylesheet'>"
         "<style>"
         ":root{--p:#3b82f6;--s:#10b981;--bg:#020617;--glass:rgba(255,255,255,"
         "0.03);}"
         "body{font-family:'Outfit',sans-serif;margin:0;padding:0;background:"
         "radial-gradient(circle at 0% 0%, #1e1b4b 0%, #020617 "
         "100%);color:#f8fafc;min-height:100vh;display:flex;justify-content:"
         "center;align-items:center;overflow-x:hidden;}"
         "*{box-sizing:border-box;transition:all 0.3s "
         "cubic-bezier(0.4,0,0.2,1);}"
         ".container{width:90%;max-width:440px;opacity:0;transform:translateY("
         "20px);animation:f 0.6s forwards;}"
         "@keyframes f{to{opacity:1;transform:translateY(0);}}"
         ".card{background:rgba(15,23,42,0.6);backdrop-filter:blur(20px);-"
         "webkit-backdrop-filter:blur(20px);border-radius:32px;padding:40px;"
         "border:1px solid rgba(255,255,255,0.08);box-shadow:0 25px 50px -12px "
         "rgba(0,0,0,0.5);position:relative;overflow:hidden;}"
         ".card::before{content:'';position:absolute;top:0;left:0;width:100%;"
         "height:4px;background:linear-gradient(90deg,var(--p),#818cf8);}"
         "h1{font-weight:800;font-size:28px;margin:0 0 "
         "8px;letter-spacing:-1px;display:flex;align-items:center;gap:12px;}"
         "h1 svg{color:var(--p);}"
         ".mac-chip{display:inline-flex;align-items:center;padding:6px "
         "14px;background:rgba(255,255,255,0.05);border-radius:100px;font-size:"
         "11px;font-weight:600;color:#94a3b8;margin-bottom:30px;border:1px "
         "solid rgba(255,255,255,0.05);}"
         ".field{margin-bottom:24px;}"
         "label{display:flex;align-items:center;gap:8px;font-size:11px;font-"
         "weight:600;color:#64748b;text-transform:uppercase;letter-spacing:1."
         "5px;margin-bottom:10px;}"
         "input,select{width:100%;background:rgba(255,255,255,0.03);border:1px "
         "solid rgba(255,255,255,0.1);border-radius:16px;padding:14px "
         "18px;color:white;font-size:15px;outline:none;}"
         "input:focus{border-color:var(--p);background:rgba(59,130,246,0.05);"
         "box-shadow:0 0 0 4px rgba(59,130,246,0.1);}"
         "button{width:100%;background:linear-gradient(135deg,var(--p),#2563eb)"
         ";color:white;border:none;padding:18px;border-radius:18px;font-weight:"
         "800;font-size:15px;cursor:pointer;margin-top:10px;box-shadow:0 10px "
         "20px -5px rgba(59,130,246,0.4);}"
         "button:hover{transform:translateY(-2px);box-shadow:0 15px 25px -5px "
         "rgba(59,130,246,0.5);}"
         ".done-icon{width:64px;height:64px;background:rgba(16,185,129,0.1);"
         "color:var(--s);border-radius:50%;display:flex;align-items:center;"
         "justify-content:center;margin:0 auto 20px;}"
         ".summary-box{background:rgba(0,0,0,0.2);border-radius:20px;padding:"
         "20px;margin:20px 0;border:1px solid rgba(255,255,255,0.03);}"
         ".sum-row{display:flex;justify-content:space-between;padding:10px "
         "0;border-bottom:1px solid rgba(255,255,255,0.03);font-size:13px;}"
         ".sum-row:last-child{border:0;}"
         ".sum-val{font-weight:700;color:var(--p);}"
         ".pass-group{position:relative;display:flex;align-items:center;}"
         ".eye-btn{position:absolute;right:15px;background:none;border:none;"
         "color:#64748b;cursor:pointer;padding:0;box-shadow:none;width:auto;"
         "margin:0;}"
         ".scan-btn{font-size:10px;font-weight:700;padding:4px "
         "10px;background:rgba(59,130,246,0.1);color:var(--p);border:1px solid "
         "rgba(59,130,246,0.2);border-radius:8px;cursor:pointer;margin-left:"
         "auto;box-shadow:none;width:auto;margin-top:0;}"
         "#scan-results{margin-top:10px;background:rgba(0,0,0,0.2);border-"
         "radius:12px;overflow:hidden;max-height:0;transition:max-height 0.4s "
         "ease;}"
         "#scan-results.open{max-height:200px;overflow-y:auto;border:1px solid "
         "rgba(255,255,255,0.05);}"
         ".scan-item{padding:12px 18px;border-bottom:1px solid "
         "rgba(255,255,255,0.03);cursor:pointer;display:flex;justify-content:"
         "space-between;align-items:center;font-size:14px;}"
         ".scan-item:hover{background:rgba(59,130,246,0.1);}"
         "</style>"
         "<script>"
         "function togglePass(){"
         "  var x=document.getElementById('p');"
         "  x.type=x.type==='password'?'text':'password';"
         "}"
         "function scanWiFi(){"
         "  var r=document.getElementById('scan-results');"
         "  r.innerHTML='<p "
         "style=\"padding:15px;font-size:12px;color:var(--p);\">Scanning "
         "networks...</p>';"
         "  r.classList.add('open');"
         "  fetch('/scan').then(res=>res.text()).then(html=>{"
         "    r.innerHTML=html;"
         "  });"
         "}"
         "function selectSsid(s){"
         "  document.getElementById('s').value=s;"
         "  document.getElementById('scan-results').classList.remove('open');"
         "}"
         "</script>"
         "</head><body>";
}

void handleRoot() {
  String html = getHeader();
  html += "<div class='container'><div class='card'>";
  html += "<h1><svg width='28' height='28' fill='none' stroke='currentColor' "
          "stroke-width='2.5'><path d='M12 2L2 7l10 5 10-5-10-5zM2 17l10 5 "
          "10-5M2 12l10 5 10-5'></path></svg> VOC SYSTEM</h1>";
  html += "<div class='mac-chip'>DEVICES MAC: " + deviceMac + "</div>";
  html += "<form action='/save' method='POST'>";

  html += "<div class='field'><label><svg width='12' height='12' fill='none' "
          "stroke='currentColor' stroke-width='2'><path d='M8.5 17.5L2 "
          "15.5l.5-13 13 1 1.5 10.5-8.5 4zm0 0l4-10.5'></path></svg> WIFI "
          "SSID <button type='button' class='scan-btn' "
          "onclick='scanWiFi()'>SCAN</button></label><input id='s' name='s' "
          "value='" +
          String(ssid) +
          "' placeholder='Network Name'><div id='scan-results'></div></div>";
  html += "<div class='field'><label>WIFI PASSWORD</label><div "
          "class='pass-group'><input id='p' name='p' "
          "type='password' value='" +
          String(password) +
          "' placeholder='••••••••'><button type='button' class='eye-btn' "
          "onclick='togglePass()'><svg width='18' height='18' viewBox='0 0 24 "
          "24' fill='none' stroke='currentColor' stroke-width='2' "
          "stroke-linecap='round' stroke-linejoin='round'><path d='M1 12s4-8 "
          "11-8 11 8 11 8-4 8-11 8-11-8-11-8z'></path><circle cx='12' cy='12' "
          "r='3'></circle></svg></button></div></div>";
  html += "<div class='field'><label>MQTT BROKER IP</label><input name='m' "
          "value='" +
          String(mqtt_server) + "' placeholder='192.168.1.xxx'></div>";
  html += "<div class='field'><label>MQTT PORT</label><input name='pt' "
          "type='number' value='" +
          String(mqtt_port) + "'></div>";
  html += "<div class='field'><label>GPIO CONTROL PIN</label><input name='mp' "
          "type='number' value='" +
          String(mocPin) + "'></div>";

  html += "<div class='field'><label>RELAY LOGIC</label><select name='al'>";
  html += "<option value='1' " + String(MOC_ACTIVE_LOW ? "selected" : "") +
          ">Active LOW (Recommended)</option>";
  html += "<option value='0' " + String(!MOC_ACTIVE_LOW ? "selected" : "") +
          ">Active HIGH</option>";
  html += "</select></div>";

  html += "<button type='submit'>APPLY CHANGES</button>";
  html += "</form></div></div></body></html>";
  server.send(200, "text/html", html);
}

