Tirta7/voc_master_data_center/esp32_mqtt_client/esp32_moc3062_singletable.ino
void handleScan() {
  Serial.println("[WIFI] Scanning...");
  int n = WiFi.scanNetworks();
  String html = "";
  if (n == 0) {
    html = "<p style='padding:10px;color:#94a3b8;'>No networks found.</p>";
  } else {
    for (int i = 0; i < n; ++i) {
      String ssidName = WiFi.SSID(i);
      int rssi = WiFi.RSSI(i);
      html +=
          "<div class='scan-item' onclick='selectSsid(\"" + ssidName + "\")'>";
      html += "<span>" + ssidName + "</span>";
      html += "<span style='font-size:10px;opacity:0.6;'>" + String(rssi) +
              " dBm</span>";
      html += "</div>";
    }
  }
  WiFi.scanDelete();
  server.send(200, "text/html", html);
}

void handleSave() {
  String s = server.arg("s");
  String p = server.arg("p");
  String m = server.arg("m");
  int pt = server.arg("pt").toInt();
  int mp = server.arg("mp").toInt();
  bool al = server.arg("al") == "1";

  saveSettings(s.c_str(), p.c_str(), m.c_str(), pt, mp, al);

  String html = getHeader();
  html +=
      "<div class='container'><div class='card' style='text-align:center;'>";
  html += "<div class='done-icon'><svg width='32' height='32' fill='none' "
          "stroke='currentColor' stroke-width='3.5'><path d='M20 6L9 "
          "17l-5-5'></path></svg></div>";
  html += "<h1 style='justify-content:center;'>Konfigurasi Tersimpan</h1>";
  html += "<p style='font-size:12px;color:#64748b;margin-bottom:10px;'>Silakan "
          "screenshot halaman ini sebagai arsip.</p>";

  html += "<div class='summary-box'>";
  html += "<div class='sum-row'><span>WIFI SSID</span><span class='sum-val'>" +
          s + "</span></div>";
  html +=
      "<div class='sum-row'><span>MQTT BROKER</span><span class='sum-val'>" +
      m + ":" + String(pt) + "</span></div>";
  html += "<div class='sum-row'><span>GPIO PIN</span><span class='sum-val'>" +
          String(mp) + "</span></div>";
  html +=
      "<div class='sum-row'><span>LOGIK RELAY</span><span class='sum-val'>" +
      String(al ? "LOW" : "HIGH") + "</span></div>";
  html += "</div>";

  html +=
      "<p style='font-weight:600;font-size:13px;color:#818cf8;animation:pulse "
      "2s infinite;'>ESP32 sedang mencoba menghubungkan diri...</p>";
  html += "</div></div></body></html>";

  server.send(200, "text/html", html);
  startDoubleBuzzer();
  delay(5000);
  ESP.restart();
}

void startPortal() {
  isConfigMode = true;
  WiFi.mode(WIFI_AP);
  String apName = "vocBilliard-MOC-" + deviceMac;
  WiFi.softAP(apName.c_str());

  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

  server.on("/", handleRoot);
  server.on("/save", HTTP_POST, handleSave);
  server.on("/scan", handleScan);
  server.onNotFound([]() {
    server.sendHeader("Location", "/", true);
    server.send(302, "text/plain", "");
  });

  server.begin();
  Serial.printf("[PORTAL] Mode AP Aktif: %s\n", apName.c_str());
  Serial.printf("[PORTAL] Akses di http://%s\n",
                WiFi.softAPIP().toString().c_str());
  startLongBuzzer();
}

// ─────────────────────────────────────────────────────────────
// KONTROL LED (Visual Indicator GPIO2)
// ─────────────────────────────────────────────────────────────

void updateLed() {
  static unsigned long lastTick = 0;
  static int step = 0;
  unsigned long now = millis();
  
  // 1. Pola 3x (Menerima Perintah) - Prioritas Tertinggi
  if (now < commandFeedbackUntil) {
    if (now - lastTick > 80) {
      lastTick = now;
      step++;
      digitalWrite(PIN_LED_WIFI, (step % 2 == 0) ? HIGH : LOW);
    }
    return;
  }

  // 2. Pola Portal Mode (Kedip Cepat)
  if (isConfigMode) {
    if (now - lastTick > 100) {
      lastTick = now;
      digitalWrite(PIN_LED_WIFI, !digitalRead(PIN_LED_WIFI));
    }
    return;
  }

  // 3. Pola Terputus (2x Kedip - Jeda)
  if (WiFi.status() != WL_CONNECTED || !client.connected()) {
    if (now - lastTick > 200) {
      lastTick = now;
      step = (step + 1) % 10; // Cycle 10 langkah
      if (step == 0 || step == 2) digitalWrite(PIN_LED_WIFI, LOW); // ON (Active Low)
      else digitalWrite(PIN_LED_WIFI, HIGH); // OFF
    }
    return;
  }

  // 4. Pola Terhubung (Kedip 1 detik)
  if (now - lastTick > 1000) {
    lastTick = now;
    digitalWrite(PIN_LED_WIFI, !digitalRead(PIN_LED_WIFI));
  }
}

bool mqttWarningActive = false; // Flag untuk alarm MQTT
void updateBuzzer() {
  unsigned long now = millis();

  // 1. Prioritas: Beep berurutan (3x on connect, dsb)
  if (buzzerBeepsRemaining > 0 && now >= buzzerNextToggle) {
    buzzerBeepsRemaining--;
    if (buzzerBeepsRemaining == 0) {
      digitalWrite(PIN_BUZZER, LOW);
      buzzerState = false;
    } else {
      buzzerState = !buzzerState;
      digitalWrite(PIN_BUZZER, buzzerState ? HIGH : LOW);
      buzzerNextToggle =
          now + (buzzerState ? buzzerToneDuration : buzzerPauseDuration);
    }
    return;
  }

  // 2. Alarm MQTT (Jika WiFi OK tapi MQTT Putus)
  if (mqttWarningActive && !isConfigMode && WiFi.status() == WL_CONNECTED) {
    static unsigned long lastWarn = 0;
    if (now - lastWarn > 2000) { // Bunyi setiap 2 detik
      lastWarn = now;
      startBuzzer(100); // Beep pendek
    }
  }
}

// ─────────────────────────────────────────────────────────────
// KONTROL LAMPU (MOC30xx via GPIO)
// ─────────────────────────────────────────────────────────────

void setLight(bool on) {
  // Pastikan mocPin sudah di-configure sebagai OUTPUT
  pinMode(mocPin, OUTPUT);

  // Terapkan logika sesuai konfigurasi wiring MOC3062
  // active-LOW : LOW = nyala, HIGH = mati
  // active-HIGH: HIGH = nyala, LOW = mati
  bool pinLevel = MOC_ACTIVE_LOW ? !on : on;
  digitalWrite(mocPin, pinLevel ? HIGH : LOW);
  lightState = on;

  Serial.printf("[MOC30xx] Pin%d → %s (Lampu %s)\n", mocPin,
                pinLevel ? "HIGH" : "LOW", on ? "MENYALA" : "MATI");
}

// ─────────────────────────────────────────────────────────────
// SPIFFS — Simpan & Muat Konfigurasi
// ─────────────────────────────────────────────────────────────

void saveConfig() {
  DynamicJsonDocument doc(256);
  doc["mocPin"] = mocPin;
  doc["lightState"] = lightState;
  doc["failsafeSeconds"] = failsafeSeconds; // Simpan sisa waktu

