Tirta7/voc_master_data_center/esp32_mqtt_client/esp32_moc3062_singletable.ino
  File f = SPIFFS.open("/moc_config.json", FILE_WRITE);
  if (f) {
    serializeJson(doc, f);
    f.close();
    Serial.println("[SPIFFS] Config tersimpan.");
  } else {
    Serial.println("[SPIFFS] GAGAL buka file untuk tulis!");
  }
}

void loadConfig() {
  if (!SPIFFS.exists("/moc_config.json")) {
    Serial.println("[SPIFFS] Config belum ada, gunakan default.");
    return;
  }
  File f = SPIFFS.open("/moc_config.json", FILE_READ);
  if (!f) {
    Serial.println("[SPIFFS] GAGAL buka config.");
    return;
  }
  DynamicJsonDocument doc(256);
  auto err = deserializeJson(doc, f);
  f.close();
  if (err) {
    Serial.printf("[SPIFFS] Parse error: %s\n", err.c_str());
    return;
  }

  if (doc.containsKey("mocPin")) {
    int savedPin = doc["mocPin"].as<int>();
    if (savedPin >= 0 && savedPin <= 39) { // Validasi range GPIO ESP32
      mocPin = savedPin;
      Serial.printf("[SPIFFS] MOC Pin dimuat: GPIO%d\n", mocPin);
    }
  }
  if (doc.containsKey("lightState")) {
    lightState = doc["lightState"].as<bool>();
    Serial.printf("[SPIFFS] Light state dimuat: %s\n",
                  lightState ? "ON" : "OFF");
  }
  if (doc.containsKey("failsafeSeconds")) {
    failsafeSeconds = doc["failsafeSeconds"].as<uint32_t>();
    Serial.printf("[SPIFFS] Failsafe Timer dimuat: %u detik\n",
                  failsafeSeconds);
  }
}

// ─────────────────────────────────────────────────────────────
// MQTT — Publish Status Telemetry
// ─────────────────────────────────────────────────────────────

void publishStatus() {
  if (!client.connected())
    return;

  String topic = baseTopic + "/status";
  DynamicJsonDocument doc(512);
  doc["status"] = lightState ? "ON" : "OFF";
  doc["online"] = true;
  doc["uptime"] = millis() / 1000;
  doc["rssi"] = WiFi.RSSI();
  doc["freeHeap"] = ESP.getFreeHeap();
  doc["ip"] = WiFi.localIP().toString();
  doc["mac"] = deviceMac;
  doc["lightState"] = lightState;
  doc["relayPin"] = mocPin;
  doc["token"] = latestToken; // 🛡️ Report back current token
  doc["hwType"] = "MOC3062";
  doc["mode"] = isManualMode ? "MANUAL" : "AUTO";
  doc["errorCode"] = lastErrorCode; // 🛡️ Report if hardware just auto-stopped
  doc["remainingSeconds"] = failsafeSeconds;

  // Reset error code setelah dikirim agar tidak "nempel" selamanya
  if (lastErrorCode != 0)
    lastErrorCode = 0;

  // Kompatibilitas dengan server yang mengharapkan array "relays"
  JsonArray relays = doc.createNestedArray("relays");
  relays.add(lightState);

  char buf[512];
  serializeJson(doc, buf);
  client.publish(topic.c_str(), buf, true); // retain=true

  Serial.printf("[MQTT] ↑ Status published: Light=%s, Mode=%s, RSSI=%d\n",
                lightState ? "ON" : "OFF", isManualMode ? "MANUAL" : "AUTO",
                WiFi.RSSI());

  // ✅ Dual-publish ke billiard/heartbeat/{mac} agar Backend deteksi Online
  String htopic = "billiard/heartbeat/" + deviceMac;
  client.publish(htopic.c_str(), buf); // Payload sama, tanpa retain
}


// ─────────────────────────────────────────────────────────────
// MQTT CALLBACK — Terima Perintah dari Server
// ─────────────────────────────────────────────────────────────

void callback(char *topic, byte *payload, unsigned int length) {
  esp_task_wdt_reset(); // Reset WDT di awal callback agar tidak timeout
  Serial.printf("[MQTT] Pesan masuk: %s (len=%u)\n", topic, length);

  // Gunakan 1024 agar cukup untuk sync_response (348 byte raw JSON)
  // ArduinoJson butuh ~2x raw size untuk internal structure
  DynamicJsonDocument doc(1024);
  DeserializationError err = deserializeJson(doc, payload, length);
  if (err) {
    Serial.printf("[MQTT] JSON parse error: %s\n", err.c_str());
    return;
  }

  String sTopic = String(topic);

  // ── 1. PING ──────────────────────────────────────────────────
  if (sTopic.endsWith("/ping")) {
    int tableId = doc["tableId"] | 0;
    DynamicJsonDocument resp(192);
    resp["tableId"] = tableId;
    resp["status"] = "PONG";
    resp["uptime"] = millis() / 1000;
    resp["rssi"] = WiFi.RSSI();
    resp["hwType"] = "MOC30xx";
    resp["mocPin"] = mocPin;

    char buf[192];
    serializeJson(resp, buf);
    client.publish((baseTopic + "/status").c_str(), buf);
    Serial.println("[MQTT] PING → PONG terkirim.");
    return;
  }

  // ── 2. SYNC RESPONSE dari Server (status awal saat boot) ─────
  if (sTopic.endsWith("/sync_response")) {
    Serial.println("[MQTT] Menerima sync response dari server...");
    JsonArray tables = doc["tables"].as<JsonArray>();

    for (JsonObject t : tables) {
      // Ambil status dari server
      const char *statusStr = t["status"] | "OFF";
      bool targetState = (strcasecmp(statusStr, "ON") == 0);

      // Debug: tampilkan nilai yang diterima dari server
      Serial.printf("[SYNC] Server kirim → status=%s targetState=%s\n",
                    statusStr, targetState ? "ON" : "OFF");

      bool pinChanged = false;

      // Jika server kirim relayPin berbeda, update mocPin
      if (t.containsKey("relayPin") && !t["relayPin"].isNull()) {
        int serverPin = t["relayPin"].as<int>();
        if (serverPin >= 0 && serverPin <= 39 && serverPin != mocPin) {
          Serial.printf(
              "[SYNC] mocPin berubah: %d → %d, wajib re-apply state\n", mocPin,
              serverPin);
          // Matikan pin lama dulu dengan benar
          bool offLevel = MOC_ACTIVE_LOW ? HIGH : LOW;
          pinMode(mocPin, OUTPUT);
          digitalWrite(mocPin, offLevel);
          // Ganti pin
          mocPin = serverPin;
          pinChanged = true;
          storageDirty = true;
          lastStateChange = millis();
        }
      }

      // Ambil sisa waktu jika ada (Hydration dari server)
      if (t.containsKey("remainingMinutes")) {
        failsafeSeconds = t["remainingMinutes"].as<uint32_t>() * 60;
        storageDirty = true;
        Serial.printf("[SYNC] Failsafe Timer diatur: %u detik\n",
                      failsafeSeconds);
      }

      // Apply state jika berbeda ATAU jika pin baru (perlu inisialisasi)
      if (lightState != targetState || pinChanged) {
        setLight(targetState);
        storageDirty = true;
        lastStateChange = millis();
        startBuzzer(400);
        Serial.printf("[SYNC] State diterapkan ke GPIO%d: %s%s\n", mocPin,
                      targetState ? "ON" : "OFF",
                      pinChanged ? " (pin baru)" : "");
      } else {
        // State sudah sama dan pin tidak berubah — konfirmasi saja
        Serial.printf("[SYNC] State sudah sesuai: %s pada GPIO%d\n",
                      lightState ? "ON" : "OFF", mocPin);
        // Re-apply ke GPIO untuk pastikan fisik benar (sanity)
        bool pinLevel = MOC_ACTIVE_LOW ? !lightState : lightState;
        digitalWrite(mocPin, pinLevel ? HIGH : LOW);
      }
      break; // 1 ESP = 1 meja, ambil entry pertama saja
    }
    return;
  }

  // ── 3. LIGHT CONTROL ─────────────────────────────────────────
  if (sTopic.endsWith("/light/set")) {
    const char *statusStr = doc["status"] | "OFF";
    bool activate = (strcasecmp(statusStr, "ON") == 0);
    bool isExtend = doc["extend"] | false;
    bool isForce = doc["force"] | false;
    latestToken = doc["token"] | 0; // 🛡️ Capture token
    int tableId = doc["tableId"] | 0;

    // Update mocPin kalau server kirim relayPin (konfigurasi baru dari server)
    if (doc.containsKey("relayPin") && !doc["relayPin"].isNull()) {
      int serverPin = doc["relayPin"].as<int>();
      if (serverPin >= 0 && serverPin <= 39 && serverPin != mocPin) {
        Serial.printf("[LIGHT] Update mocPin dari server: %d → %d\n", mocPin,
                      serverPin);
        mocPin = serverPin;
        storageDirty = true;
        lastStateChange = millis();
      }
    }

    unsigned long now = millis();

    if (!activate) {
      // MATIKAN LAMPU
      if (lightProtectedUntil > now && !isForce) {
        Serial.printf("[PROTECT] Diblokir (Race Condition, sisa %lus). Kirim "
                      "force=true untuk override.\n",
                      (lightProtectedUntil - now) / 1000);
        return;
      }
      setLight(false);
      lightProtectedUntil = 0;
      storageDirty = true;
      lastStateChange = now;
      startBuzzer(200);
      // tableId = primary key database, bukan nomor urut meja
      Serial.printf("[RELAY] DB_ID:%d MAC:%s → LAMPU MATI\n", tableId,
                    deviceMac.c_str());

    } else {
      // NYALAKAN LAMPU
      unsigned long protDuration = isExtend ? 60000 : 30000;
      lightProtectedUntil = now + protDuration;
      setLight(true);
      storageDirty = true;
      lastStateChange = now;
      if (isExtend)
        startDoubleBuzzer();
      else
        startBuzzer(500);
      Serial.printf("[RELAY] DB_ID:%d MAC:%s → LAMPU MENYALA (%s)\n", tableId,
                    deviceMac.c_str(), isExtend ? "EXTEND" : "START");
    }
    // Command dari server selalu meriset manual mode kembali ke AUTO
    isManualMode = false;
    commandFeedbackUntil = millis() + 1000; // Feedback LED
    publishStatus(); // 🚀 Kirim status segera agar backend verifikasi token

    // 🛡️ Update Failsafe Timer (v17.5.1)
    if (activate) {
      // Jika ada duration (Prepaid) -> Set Timer. Jika tidak ada (Open Table)
      // -> Reset ke 0
      failsafeSeconds = (doc["duration"] | 0) * 60;
      storageDirty = true;
      if (failsafeSeconds > 0) {
        Serial.printf("[TIMER] Failsafe dimulai: %u detik\n", failsafeSeconds);
      } else {
        Serial.println("[TIMER] Mode Open Table (Tanpa Auto-Stop)");
      }
    } else {
      failsafeSeconds = 0;
      storageDirty = true;
    }

    return;
  }

  // ── 4. GPIO DIAGNOSTIC (Tes pin langsung) ────────────────────
  if (sTopic.endsWith("/gpio/set")) {
    int pin = doc["pin"] | -1;
    const char *st = doc["status"] | "OFF";
    bool state = (strcasecmp(st, "ON") == 0);

