Tirta7/voc_master_data_center/esp32_mqtt_client/esp32_moc3062_singletable.ino
    if (pin >= 0 && pin <= 39) {
      pinMode(pin, OUTPUT);
      digitalWrite(pin, state ? HIGH : LOW);
      Serial.printf("[DIAG] GPIO%d → %s\n", pin, st);
      startBuzzer(100);
    }
    return;
  }

  // ── 5. CONFIG — Ubah mocPin runtime ──────────────────────────
  if (sTopic.endsWith("/config/set")) {
    /*
     * Payload: { "mocPin": 5 }
     * Ganti pin GPIO yang dipakai MOC3062.
     * Re-apply dilakukan di loop() via pendingPinChange flag
     * agar tidak ada blocking SPIFFS write di dalam callback.
     */
    if (doc.containsKey("mocPin")) {
      int newPin = doc["mocPin"].as<int>();
      if (newPin >= 0 && newPin <= 39) {
        if (mocPin != newPin) {
          // Matikan output pin lama dengan benar (respek active-LOW)
          bool offLevel = MOC_ACTIVE_LOW ? HIGH : LOW;
          pinMode(mocPin, OUTPUT);
          digitalWrite(mocPin, offLevel);
          Serial.printf("[CONFIG] Pin lama GPIO%d dimatikan.\n", mocPin);
        }
        // Set flag, biarkan loop() yang handle re-apply + save
        pendingNewPin = newPin;
        pendingPinChange = true;
        Serial.printf("[CONFIG] mocPin akan diganti ke GPIO%d (pending)...\n",
                      newPin);
      } else {
        Serial.printf("[CONFIG] mocPin tidak valid: %d (harus 0-39)\n", newPin);
      }
    }
    return;
  }

  // ── 6. SYSTEM COMMAND ────────────────────────────────────────
  if (sTopic.endsWith("/system/set")) {
    const char *cmd = doc["command"] | "";
    if (strcmp(cmd, "REBOOT") == 0) {
      Serial.println("[SYSTEM] Reboot via MQTT...");
      startBuzzer(1000);
      delay(1500);
      ESP.restart();
    }
    return;
  }
}

// ─────────────────────────────────────────────────────────────
// MQTT — Reconnect Handler
// ─────────────────────────────────────────────────────────────

void handleMqttConnection() {
  if (client.connected())
    return;

  if (millis() - lastMqttRetry < 8000)
    return;
  lastMqttRetry = millis();

  String clientId = "SpotOn-MOC-" + deviceMac;
  String lwtTopic = baseTopic + "/status";

  Serial.printf("[MQTT] Menghubungi broker %s:%d...\n", mqtt_server, mqtt_port);

  client.setKeepAlive(15); // 🛡️ Fast Disconnect Detection (v17.5)
  if (client.connect(clientId.c_str(), lwtTopic.c_str(), 1, true,
                     "{\"status\":\"offline\",\"hwType\":\"MOC3062\"}")) {

    // LWT online
    client.publish(lwtTopic.c_str(),
                   "{\"status\":\"online\",\"hwType\":\"MOC3062\"}", true);

    // Subscribe ke semua topik milik device ini
    client.subscribe((baseTopic + "/#").c_str());

    // Minta sync state dari server
    client.publish("billiard/table/sync", deviceMac.c_str());

    Serial.printf("[MQTT] Terhubung! Subscribed: %s/#\n", baseTopic.c_str());
    Serial.println("[MQTT] Sync request dikirim ke server.");

    // 🔊 Konfirmasi Connect: 3x Beep
    mqttWarningActive = false;
    buzzerBeepsRemaining = 6; // 3x Toggle (On/Off)
    buzzerState = true;
    buzzerToneDuration = 100;
    buzzerPauseDuration = 100;
    digitalWrite(PIN_BUZZER, HIGH);
    buzzerNextToggle = millis() + 100;

  } else {
    int rc = client.state();
    Serial.printf("[MQTT] Gagal (rc=%d). Retry 8s lagi.\n", rc);
    mqttWarningActive = true; // Aktifkan alarm jika gagal konek ke server
    if (rc == -2) {
      Serial.println(">> RC -2: Cek IP server, port 1883, Mosquitto berjalan.");
    }
  }
}

// ─────────────────────────────────────────────────────────────
// WIFI EVENT HANDLER
// ─────────────────────────────────────────────────────────────

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Terhubung! IP: %s\n",
                  WiFi.localIP().toString().c_str());
    digitalWrite(PIN_LED_WIFI, HIGH);
    wasWifiConnected = true;
    lastMqttRetry = 0; // Langsung retry MQTT
    break;
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Terputus dari AP. Auto-reconnect...");
    digitalWrite(PIN_LED_WIFI, LOW);
    wasWifiConnected = false;
    break;
  default:
    break;
  }
}

// ─────────────────────────────────────────────────────────────
// SETUP
// ─────────────────────────────────────────────────────────────

void setup() {
  // ── PRIORITAS PERTAMA: Matikan MOC pin sebelum apapun ────────
  // Ini meminimalkan durasi blink yang terjadi saat ESP32 boot
  // (GPIO masih floating saat bootloader, pull-up hardware 10kΩ
  //  adalah solusi terbaik, ini adalah software safety net)
  pinMode(mocPin, OUTPUT);
  bool safeOffLevel = MOC_ACTIVE_LOW ? HIGH : LOW;
  digitalWrite(mocPin, safeOffLevel); // Matikan MOC3062 secepat mungkin

  Serial.begin(115200);
  Serial.println("\n\n=== BOOTING ESP32 — MOC30xx SINGLE TABLE MODE ===");
  Serial.println("VOC Billiard System | Hybrid IoT");
  Serial.println("=================================================");

  // 1. Pin dasar
  pinMode(PIN_BUZZER, OUTPUT);
  pinMode(PIN_BUTTON, INPUT_PULLUP);
  pinMode(PIN_LED_WIFI, OUTPUT);
  digitalWrite(PIN_LED_WIFI, HIGH); // Matikan LED saat boot (Active LOW)
  digitalWrite(PIN_BUZZER, LOW);

  // 2. Mount SPIFFS & load config (mocPin, lightState)
  if (SPIFFS.begin(true)) {
    Serial.println("[SPIFFS] Mount berhasil.");
    loadConfig();
  } else {
    Serial.println("[SPIFFS] Mount GAGAL! Gunakan nilai default.");
  }

  // 3. Inisialisasi pin MOC3062 — RESTORE state dari SPIFFS
  //
  // 5. Baca MAC Address (untuk baseTopic & client ID)
  uint8_t baseMac[6];
  esp_efuse_mac_get_default(baseMac);
  char macStr[13];
  sprintf(macStr, "%02X%02X%02X%02X%02X%02X", baseMac[0], baseMac[1],
          baseMac[2], baseMac[3], baseMac[4], baseMac[5]);
  deviceMac = String(macStr);
  baseTopic = "billiard/table/" + deviceMac;

  // 6. Muat Konfigurasi dari NVM
  loadSettings();

  Serial.printf("[DEVICE] MAC Address : %s\n", deviceMac.c_str());
  Serial.printf("[DEVICE] Base Topic  : %s\n", baseTopic.c_str());
  Serial.printf("[DEVICE] MOC Control : GPIO%d\n", mocPin);

  // 7. Inisialisasi MOC Pin dengan logika yang tepat
  pinMode(mocPin, OUTPUT);
  bool bootPinLevel = MOC_ACTIVE_LOW ? !lightState : lightState;
  digitalWrite(mocPin, bootPinLevel ? HIGH : LOW);

  // 8. Putuskan mode: WiFi atau Portal
  WiFi.onEvent(onWifiEvent);

