Tirta7/voc_master_data_center/esp32_mqtt_client/esp32_moc3062_singletable.ino
  if (strlen(ssid) == 0) {
    Serial.println("[SYSTEM] SSID Kosong. Masuk Mode Portal Konfigurasi...");
    startPortal();
  } else {
    WiFi.mode(WIFI_STA);
    esp_wifi_set_ps(WIFI_PS_NONE); // 🛡️ Matikan hemat daya agar responsif dan tidak tiba-tiba offline
    WiFi.setAutoReconnect(true);
    WiFi.begin(ssid, password);
    Serial.printf("[WiFi] Mencoba menyambung ke SSID '%s'...\n", ssid);

    int retry = 0;
    while (WiFi.status() != WL_CONNECTED && retry < 15) {
      delay(500);
      Serial.print(".");
      retry++;
    }
    Serial.println();

    if (WiFi.status() != WL_CONNECTED) {
      Serial.println(
          "[WiFi] Gagal konek cepat. Masuk Mode Portal Konfigurasi...");
      startPortal();
    } else {
      Serial.printf("[WiFi] Terhubung! IP: %s\n",
                    WiFi.localIP().toString().c_str());
      startDoubleBuzzer();
    }
  }

  // 9. MQTT setup (Hanya relevan jika tidak dalam Mode Portal)
  if (!isConfigMode) {
    client.setKeepAlive(120);
    client.setSocketTimeout(10);
    client.setBufferSize(1024);
    client.setServer(mqtt_server, mqtt_port);
    client.setCallback(callback);
  }

  // 10. Watchdog 30 detik
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  esp_task_wdt_config_t wdt_cfg = {
      .timeout_ms = 30000, .idle_core_mask = 0, .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdt_cfg);
#else
  esp_task_wdt_init(30, true);
#endif
  esp_task_wdt_add(NULL);

  Serial.println("\n=== MOC3062 NODE READY ===");
  Serial.println("=========================\n");
}

// ─────────────────────────────────────────────────────────────
// LOOP
// ─────────────────────────────────────────────────────────────

void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();

  updateBuzzer();
  updateLed(); // 💡 Indikator Visual GPIO2

  // ── Mode Konfigurasi ───────────────────────────────────────
  if (isConfigMode) {
    dnsServer.processNextRequest();
    server.handleClient();
    return; // Loncat ke loop berikutnya, jangan jalankan Mqtt
  }

  // ── Handle Push Button (Multi-function) ────────────────────
  // ESP32-C3 SuperMini: GPIO9 = Tombol BOOT (active LOW)
  // - Klik singkat (<1.5s)  : Manual toggle lampu
  // - Tahan 2-5s            : Buzzer peringatan (masih bisa dibatalkan)
  // - Tahan >5s             : HARD RESET (hapus semua config NVM + reboot)
  static unsigned long btnHoldStartTime = 0;
  static bool lastBtnState = HIGH;
  static bool warnBeepSent = false; // Flag: sudah bunyi peringatan 2s?
  bool currentBtnState = digitalRead(PIN_BUTTON);

  if (currentBtnState == LOW) {
    if (btnHoldStartTime == 0) {
      btnHoldStartTime = now;
      warnBeepSent = false;
    }

    unsigned long heldMs = now - btnHoldStartTime;

    // ⚠️ PERINGATAN di 2 detik: 3x Beep cepat (masih bisa dibatalkan)
    if (heldMs > 2000 && !warnBeepSent) {
      warnBeepSent = true;
      buzzerBeepsRemaining = 6; // 3x Toggle = 3 beep
      buzzerState = true;
      buzzerToneDuration = 80;
      buzzerPauseDuration = 80;
      digitalWrite(PIN_BUZZER, HIGH);
      buzzerNextToggle = now + 80;
      Serial.println("[BUTTON] ⚠️ Tahan terus 3 detik lagi untuk HARD RESET...");
    }

    // 🔴 HARD RESET di 5 detik
    if (heldMs > 5000) {
      Serial.println("[BUTTON] 🔴 HARD RESET! Menghapus semua konfigurasi...");
      // Matikan lampu dulu sebelum reset
      setLight(false);
      // Bunyi panjang tanda reset
      digitalWrite(PIN_BUZZER, HIGH);
      delay(1500);
      digitalWrite(PIN_BUZZER, LOW);
      delay(300);
      // Hapus semua NVM
      preferences.begin("voc-config", false);
      preferences.clear();
      preferences.end();
      // Hapus SPIFFS
      SPIFFS.format();
      Serial.println("[BUTTON] ✅ NVM & SPIFFS bersih. Restarting...");
      delay(500);
      ESP.restart();
    }

  } else {
    // 🖱️ KLIK BIASA: Manual Toggle (handle saat tombol dilepas)
    if (lastBtnState == LOW && btnHoldStartTime > 0 && (now - btnHoldStartTime < 1500)) {
      isManualMode = true;
      setLight(!lightState);
      storageDirty = true;
      lastStateChange = now;
      startBuzzer(150);
      Serial.printf("[BUTTON] Klik! Mode: MANUAL, Lampu: %s\n",
                    lightState ? "ON" : "OFF");
      publishStatus();
    }
    btnHoldStartTime = 0;
    warnBeepSent = false;
  }
  lastBtnState = currentBtnState;

  if (WiFi.status() == WL_CONNECTED) {
    // MQTT reconnect & loop
    handleMqttConnection();
    client.loop();

    // ── Telemetry tiap 30s ───────────────────────────────────
    if (client.connected() && (now - lastStatusUpdate > STATUS_INTERVAL)) {
      lastStatusUpdate = now;
      publishStatus();
    }

    // ── Heartbeat tiap 30s ke billiard/heartbeat/{mac} ─────────
    if (client.connected() && (now - lastHeartbeat > HEARTBEAT_INTERVAL)) {
      lastHeartbeat = now;
      String htopic = "billiard/heartbeat/" + deviceMac;
      DynamicJsonDocument hdoc(256);
      hdoc["online"] = true;
      hdoc["uptime"] = millis() / 1000;
      hdoc["rssi"] = WiFi.RSSI();
      hdoc["hwType"] = "MOC3062";
      hdoc["lightState"] = lightState;
      hdoc["status"] = lightState ? "ON" : "OFF";
      hdoc["relayPin"] = mocPin;
      hdoc["mode"] = isManualMode ? "MANUAL" : "AUTO";
      char hbuf[256];
      serializeJson(hdoc, hbuf);
      client.publish(htopic.c_str(), hbuf);
      Serial.printf("[MQTT] Heartbeat terkirim ke %s\n", htopic.c_str());
    }

  } else {
    if (now - lastWifiCheck > WIFI_FULL_RECONNECT) {
      lastWifiCheck = now;
      Serial.println("[WiFi] Belum tersambung, coba full reconnect...");
      WiFi.disconnect(true);
      delay(500);
      WiFi.begin(ssid, password);
    }
  }

  // ── 🛡️ FAILS-SAFE HARDWARE TIMER (v17.5) ──────────────────
  if (lightState && failsafeSeconds > 0) {
    if (now - lastFailsafeTick >= 1000) {
      lastFailsafeTick = now;
      failsafeSeconds--;

      // Update storage setiap 30 detik agar tidak boros flash
      if (failsafeSeconds % 30 == 0)
        storageDirty = true;

      if (failsafeSeconds == 0) {
        Serial.println(
            "[TIMER] ⏰ Failsafe Triggered! Mematikan lampu mandiri...");
        setLight(false);
        lastErrorCode = 16; // Code for 'Safe Stop'
        storageDirty = true;
        lastStateChange = now;
        startBuzzer(1000); // Buzzer panjang tanda waktu habis
        publishStatus();   // Segera lapor ke server
      }
    }
  } else if (!lightState) {
    failsafeSeconds = 0;
  }

  // ── Deferred SPIFFS Save (3s setelah perubahan terakhir) ──
  if (storageDirty && (now - lastStateChange > STORAGE_SAVE_DELAY)) {
    saveConfig();
    storageDirty = false;
  }

  // ── Pending Pin Change (dari /config/set MQTT command) ──────
  // Dilakukan di loop() bukan di callback agar tidak blocking
  if (pendingPinChange && pendingNewPin >= 0) {
    pendingPinChange = false;
    mocPin = pendingNewPin;
    pendingNewPin = -1;
    setLight(lightState); // Re-apply state di pin baru
    storageDirty = true;
    lastStateChange = millis();
    startBuzzer(300);
    Serial.printf("[CONFIG] mocPin resmi diubah ke GPIO%d\n", mocPin);
    publishStatus();
  }

  // ── Sanity Check: Pastikan pin GPIO sesuai state ──────────
  // Koreksi output pin tiap 10 detik jika ada glitch
  static unsigned long lastPinVerify = 0;
  if (now - lastPinVerify > 10000) {
    lastPinVerify = now;
    int currentPinState = digitalRead(mocPin);
    // Hitung expected pin level sesuai logika active-LOW/HIGH
    bool expectedLevel = MOC_ACTIVE_LOW ? !lightState : lightState;
    bool pinIsHigh = (currentPinState == HIGH);
    if (pinIsHigh != expectedLevel) {
      Serial.printf("[FIX] Pin GPIO%d tidak sesuai state, koreksi...\n",
                    mocPin);
      digitalWrite(mocPin, expectedLevel ? HIGH : LOW);
    }
  }
}
